# Практическая работа №5
---

**Выполнил: Ковалев А.И.**

**Группа: ПИ19-3**

Структура проекта: src/ - директория с кодом, resources/ - директория с бд university_life.db

_Ниже представлен листинг кода_:

### src/models.py

In [31]:
from sqlalchemy.ext.declarative import as_declarative, declared_attr
from sqlalchemy import (Column, Integer, String, DateTime, ForeignKey, CheckConstraint, Float)

__all__ = [
    "University",
    "Student",
    "Subject",
    "ExamMark",
    "ActivityLecturer",
    "SubjectLecturer"
]

CASCADE = "CASCADE"
SHORT_VARCHAR = 80


@as_declarative()
class Base(object):
    id = Column(Integer(), primary_key=True, autoincrement=True)

    @classmethod
    @property
    def columns(cls):
        return cls.__table__.columns

    c = columns

    def _repr(self, **args) -> str:
        field_strings = []
        for key, field in args.items():
            field_strings.append(f'{key}={field!r}')

        return f"<{self.__class__.__name__} {field_strings}>"

    @declared_attr
    def __tablename__(self):
        return self.__name__.lower()

    def __repr__(self) -> str:
        return self._repr(id=self.id)

    __str__ = __repr__


class University(Base):
    name = Column(String(SHORT_VARCHAR), nullable=False)
    rating = Column(Integer())
    city = Column(String(SHORT_VARCHAR), nullable=False)

    def __repr__(self):
        return self._repr(name=self.name, rating=self.rating, city=self.city)


class Student(Base):
    first_name = Column(String(SHORT_VARCHAR), nullable=False)
    last_name = Column(String(SHORT_VARCHAR), nullable=False)
    stipend = Column(Float(), CheckConstraint("stipend >= 0.00", name="stipend_is_positive"))
    course = Column(Integer(), nullable=False)
    city = Column(String(SHORT_VARCHAR))
    birthdate = Column(DateTime())
    university_id = Column(Integer(), ForeignKey("university.id", ondelete=CASCADE))

    def __repr__(self):
        return self._repr(first_name=self.first_name,
                          last_name=self.last_name,
                          stipend=self.stipend,
                          course=self.course,
                          birthdate=self.birthdate,
                          university_id=self.university_id)


class Subject(Base):
    name = Column(String(SHORT_VARCHAR), nullable=False)
    hour = Column(Integer(), nullable=False)
    semester = Column(Integer(), nullable=False)

    def __repr__(self):
        return self._repr(name=self.name, hour=self.hour, semester=self.semester)


class ExamMark(Base):
    student_id = Column(Integer(), ForeignKey("student.id", ondelete=CASCADE))
    subject_id = Column(Integer(), ForeignKey("subject.id", ondelete=CASCADE))
    mark = Column(Integer())
    date = Column(DateTime(), nullable=False)

    def __repr__(self):
        return self._repr(student_id=self.student_id,
                          subject_id=self.subject_id,
                          mark=self.mark,
                          date=self.date)


class ActivityLecturer(Base):
    first_name = Column(String(SHORT_VARCHAR), nullable=False)
    last_name = Column(String(SHORT_VARCHAR), nullable=False)
    city = Column(String(SHORT_VARCHAR))
    university_id = Column(Integer(), ForeignKey("university.id", ondelete=CASCADE))

    def __repr__(self):
        return self._repr(first_name=self.first_name,
                          last_name=self.last_name,
                          city=self.city,
                          university_id=self.university_id)


class SubjectLecturer(Base):
    lecturer_id = Column(Integer(), ForeignKey("activitylecturer.id", ondelete=CASCADE))
    subject_id = Column(Integer, ForeignKey("subject.id", ondelete=CASCADE))

    def __repr__(self):
        return self._repr(lecturer_id=self.lecturer_id, subject_id=self.subject_id)

### src/database.py

In [32]:
from sqlalchemy import create_engine
from sqlalchemy.engine import Engine
from sqlalchemy.orm.session import sessionmaker, Session
from datetime import datetime


class DataBase:
    DATABASE = "sqlite"
    DB_NAME = "resources/university_life.db"
    engine: Engine = create_engine(f"{DATABASE}:///{DB_NAME}", echo=False)
    # engine: Engine = create_engine("mysql://root:1234@localhost/educational_activities?host=localhost?port=3306")
    session: Session = sessionmaker(bind=engine)()

    @staticmethod
    def init_ascii_data():
        DataBase.session.add(ActivityLecturer(first_name="Sokolov", last_name="Petr",
                                              city="Moscow", university_id=22))
        DataBase.session.add(Student(first_name="Alexey", last_name="Kovalev", stipend=2925, course=2,
                                     city="Troitsky", birthdate=datetime(2001, 9, 14), university_id=22))
        DataBase.session.add(Subject(name="Python", hour=40, semester=4))
        DataBase.session.add(University(name="FinUniv", rating=100, city="Moscow"))
        DataBase.session.commit()

In [33]:
from sqlalchemy import select, cast, VARCHAR
from sqlalchemy.sql import func, and_
from sqlalchemy.sql.elements import BinaryExpression, Cast
from sqlalchemy.orm import Query
import pandas as pd
pd.set_option('display.max_colwidth', None)

In [34]:
db = DataBase()
F_DATE = "<<f-date>>"
F_DIGIT = "<<f-digit>>"

In [35]:
def as_string(col) -> Cast:
    return cast(col, VARCHAR)


def concat_ws(sep: str, *args) -> BinaryExpression:
    cols = list(map(as_string, args))
    query = ""
    for i in range(len(cols)):
        query += cols[i]
        if i != len(cols) - 1:
            query += sep

    return query


def not_null(*args):
    return and_(*[col.isnot(None) for col in args])


def create_dataframe(result_list):
    keys = result_list[0].keys()
    result = {k: [] for k in keys}
    for raw in result_list:
        for i, k in enumerate(keys):
            result[k].append(raw[i])

    return pd.DataFrame(result)

# Задания 1-8:

In [38]:
def first() -> pd.DataFrame:
    """
    Составьте запрос для таблицы STUDENT таким образом, чтобы выходная
    таблица содержала один столбец, содержащий последовательность
    разделенных символом “;” (точка с запятой) значений всех столбцов этой
    таблицы, и при этом текстовые значения должны отображаться
    прописными символами (верхний регистр), то есть быть
    представленными в следующем виде:
    10;КУЗНЕЦОВ;БОРИС;0;БРЯНСК;8/12/1981;10.
    """
    label = "RESULT"
    query = func.upper(concat_ws(
        ";",
        Student.id,
        Student.last_name,
        Student.first_name,
        Student.stipend,
        Student.city,
        F_DATE,
        as_string(Student.university_id) + "."
    )).label(label)
    query = select([query, Student.birthdate]).where(not_null(*Student.c))

    result_proxy = db.session.execute(query)
    result = [
        (raw[0].replace(F_DATE.upper(), raw[1].strftime("%#d/%m/%Y"))).upper()
        for raw in result_proxy
    ]
    return pd.DataFrame({label: result})


first()

                                              RESULT
0             1;ИВАНОВ;ИВАН;150.0;ОРЕЛ;3/12/1982;10.
1            3;ПЕТРОВ;ПЕТР;200.0;КУРСК;1/12/1980;10.
2         6;СИДОРОВ;ВАДИМ;150.0;МОСКВА;7/06/1979;22.
3         10;КУЗНЕЦОВ;БОРИС;0.0;БРЯНСК;8/12/1981;10.
4        12;ЗАЙЦЕВА;ОЛЬГА;250.0;ЛИПЕЦК;1/05/1981;10.
5        55;БЕЛКИН;ВАДИМ;250.0;ВОРОНЕЖ;7/01/1980;10.
6        265;ПАВЛОВ;АНДРЕЙ;0.0;ВОРОНЕЖ;5/11/1979;10.
7        654;ЛУКИН;АРТЕМ;200.0;ВОРОНЕЖ;1/12/1981;10.
8  655;KOVALEV;ALEXEY;2925.0;TROITSKY;14/09/2001;22.

In [39]:
def second() -> pd.DataFrame:
    """
    Составьте запрос для таблицы STUDENT таким образом, чтобы выходная
    таблица содержала всего один столбец в следующем виде:
    Б.КУЗНЕЦОВ; место жительства-БРЯНСК; родился - 8.12.81.
    """
    label = "RESULT"
    query = concat_ws(
        "; ",
        func.substr(func.upper(Student.first_name), 1, 1) + "." + func.upper(Student.last_name),
        "место жительства-" + func.upper(Student.city),
        "родился - " + F_DATE + "."
    ).label(label)
    query = select([query, Student.birthdate]).where(not_null(*Student.c))

    result_proxy = db.session.execute(query).fetchall()
    result = []
    for raw_proxy in result_proxy:
        i = raw_proxy[0].index(";")
        result.append((raw_proxy[0][:i].upper() + raw_proxy[0][i:])
                      .replace(F_DATE, raw_proxy[1].strftime("%#d.%m.%y")))

    return pd.DataFrame({label: result})


second()

                                                      RESULT
0        И.ИВАНОВ; место жительства-Орел; родился - 3.12.82.
1       П.ПЕТРОВ; место жительства-Курск; родился - 1.12.80.
2     В.СИДОРОВ; место жительства-Москва; родился - 7.06.79.
3    Б.КУЗНЕЦОВ; место жительства-Брянск; родился - 8.12.81.
4     О.ЗАЙЦЕВА; место жительства-Липецк; родился - 1.05.81.
5     В.БЕЛКИН; место жительства-Воронеж; родился - 7.01.80.
6     А.ПАВЛОВ; место жительства-Воронеж; родился - 5.11.79.
7      А.ЛУКИН; место жительства-Воронеж; родился - 1.12.81.
8  A.KOVALEV; место жительства-TROITSKY; родился - 14.09.01.

In [40]:
def third() -> pd.DataFrame:
    """
    Составьте запрос для таблицы STUDENT таким образом, чтобы выходная
    таблица содержала всего один столбец в следующем виде:
    б.кузнецов; место жительства-брянск; родился: 8-дек-1981.
    """
    label = "RESULT"
    query = func.lower(concat_ws(
        "; ",
        func.substr(Student.first_name, 1, 1) + "." + Student.last_name,
        "место жительства-" + Student.city,
        "родился: " + F_DATE + "."
    )).label(label)
    query = select([query, Student.birthdate]).where(not_null(*Student.c))

    result_proxy = db.session.execute(query)
    result = [
        raw[0].replace(F_DATE, raw[1].strftime("%#d-%b-%Y")).lower()
        for raw in result_proxy
    ]
    return pd.DataFrame({label: result})


third()

                                                        RESULT
0        и.иванов; место жительства-орел; родился: 3-dec-1982.
1       п.петров; место жительства-курск; родился: 1-dec-1980.
2     в.сидоров; место жительства-москва; родился: 7-jun-1979.
3    б.кузнецов; место жительства-брянск; родился: 8-dec-1981.
4     о.зайцева; место жительства-липецк; родился: 1-may-1981.
5     в.белкин; место жительства-воронеж; родился: 7-jan-1980.
6     а.павлов; место жительства-воронеж; родился: 5-nov-1979.
7      а.лукин; место жительства-воронеж; родился: 1-dec-1981.
8  a.kovalev; место жительства-troitsky; родился: 14-sep-2001.

In [41]:
def fourth() -> pd.DataFrame:
    """
    Составьте запрос для таблицы STUDENT таким образом, чтобы выходная
    таблица содержала всего один столбец в следующем виде:
    Борис Кузнецов родился в 1981 году.
    """
    label = "RESULT"
    query = (
            as_string(func.upper(func.substr(Student.first_name, 1, 1))) +
            func.lower(func.substr(Student.first_name, 2)) +
            " " +
            func.upper(func.substr(Student.last_name, 1, 1)) +
            func.lower(func.substr(Student.last_name, 2)) +
            " родился в " +
            F_DATE +
            " году."
    ).label(label)
    query = select([query, Student.birthdate]).where(not_null(*Student.c))

    result_proxy = db.session.execute(query)
    result = [
        raw[0].replace(F_DATE, raw[1].strftime("%Y"))
        for raw in result_proxy
    ]
    return pd.DataFrame({label: result})


fourth()

                                RESULT
0     Иван Иванов родился в 1982 году.
1     Петр Петров родился в 1980 году.
2   Вадим Сидоров родился в 1979 году.
3  Борис Кузнецов родился в 1981 году.
4   Ольга Зайцева родился в 1981 году.
5    Вадим Белкин родился в 1980 году.
6   Андрей Павлов родился в 1979 году.
7     Артем Лукин родился в 1981 году.
8  Alexey Kovalev родился в 2001 году.

In [42]:
def fifth() -> pd.DataFrame:
    """
    Вывести фамилии, имена студентов и величину получаемых ими
    стипендий, при этом значения стипендий должны быть увеличены в 100 раз.
    """
    query = select([Student.last_name,
                    Student.first_name,
                    (Student.stipend * 100).label("stipend")]).where(not_null(*Student.c))

    result_proxy = db.session.execute(query)
    result = {k: [] for k in result_proxy.keys()}
    for raw in result_proxy:
        for k in raw.keys():
            result[k].append(raw[k])

    return pd.DataFrame(result)


fifth()

  last_name first_name   stipend
0    Иванов       Иван   15000.0
1    Петров       Петр   20000.0
2   Сидоров      Вадим   15000.0
3  Кузнецов      Борис       0.0
4   Зайцева      Ольга   25000.0
5    Белкин      Вадим   25000.0
6    Павлов     Андрей       0.0
7     Лукин      Артем   20000.0
8   Kovalev     Alexey  292500.0

In [43]:
def sixth() -> pd.DataFrame:
    """
    Тоже, что и в задаче 4, но только для студентов 1, 2 и 4-го курсов и таким
    образом, чтобы фамилии и имена были выведены прописными буквами.
    """
    label = "RESULT"
    query = (
            func.upper(Student.first_name) +
            " " +
            func.upper(Student.last_name) +
            " родился в " +
            F_DATE +
            " году."
    ).label(label)
    query = select([query, Student.birthdate]).where(and_(not_null(*Student.c), Student.course.in_([1, 2, 4])))

    result_proxy = db.session.execute(query)
    result = [
        raw[0].replace(F_DATE, raw[1].strftime("%Y"))
        for raw in result_proxy
    ]
    return pd.DataFrame({label: result})


sixth()

                                RESULT
0     Иван Иванов родился в 1982 году.
1   Вадим Сидоров родился в 1979 году.
2  Борис Кузнецов родился в 1981 году.
3   Ольга Зайцева родился в 1981 году.
4  ALEXEY KOVALEV родился в 2001 году.

In [44]:
def seventh() -> pd.DataFrame:
    """
    Составьте запрос для таблицы UNIVERSITY таким образом, чтобы
    выходная таблица содержала всего один столбец в следующем виде:
    Код-10; ВГУ-г.ВОРОНЕЖ; Рейтинг=296.
    """
    label = "RESULT"
    query = concat_ws(
        "; ",
        "Код-" + as_string(University.id),
        func.upper(University.name) + "-г." + func.upper(University.city),
        "Рейтинг=" + as_string(University.rating) + "."
    ).label(label)
    query = select([query]).where(not_null(*University.c))

    result_proxy = db.session.execute(query)
    result = []
    for raw_proxy in result_proxy:
        i = raw_proxy[0].index("-г.") + 3
        j = i + raw_proxy[0][i:].index(";")
        result.append(raw_proxy[0][:i] + raw_proxy[0][i:j].upper() + raw_proxy[0][j:])

    return pd.DataFrame({label: result})


seventh()

                                    RESULT
0      Код-10; ВГУ-г.ВОРОНЕЖ; Рейтинг=296.
1  Код-11; НГУ-г.НОВОСИБИРСК; Рейтинг=345.
2     Код-14; БГУ-г.БЕЛГОРОД; Рейтинг=326.
3        Код-15; ТГУ-г.ТОМСК; Рейтинг=368.
4     Код-18; ВГМА-г.ВОРОНЕЖ; Рейтинг=327.
5       Код-22; МГУ-г.МОСКВА; Рейтинг=606.
6       Код-32; РГУ-г.РОСТОВ; Рейтинг=416.
7   Код-33; FINUNIV-г.MOSCOW; Рейтинг=100.

In [45]:
def eighth() -> pd.DataFrame:
    """
    Тоже, что и в задаче 7, но значения рейтинга требуется округлить до
    первого знака (например , значение 382 округляется до 400).
    """
    label = "RESULT"
    query = concat_ws(
        "; ",
        "Код-" + as_string(University.id),
        func.upper(University.name) + "-г." + func.upper(University.city),
        "Рейтинг=" + F_DIGIT + "."
    ).label(label)
    query = select([query, University.rating]).where(not_null(*University.c))

    result_proxy = db.session.execute(query)
    result = [row[0].replace(F_DIGIT, str(round(row[1], -len(str(row[1])) + 1)))
              for row in result_proxy]
    return pd.DataFrame({label: result})


eighth()

                                    RESULT
0      Код-10; ВГУ-г.Воронеж; Рейтинг=300.
1  Код-11; НГУ-г.Новосибирск; Рейтинг=300.
2     Код-14; БГУ-г.Белгород; Рейтинг=300.
3        Код-15; ТГУ-г.Томск; Рейтинг=400.
4     Код-18; ВГМА-г.Воронеж; Рейтинг=300.
5       Код-22; МГУ-г.Москва; Рейтинг=600.
6       Код-32; РГУ-г.Ростов; Рейтинг=400.
7   Код-33; FINUNIV-г.MOSCOW; Рейтинг=100.

# Задания 9-20:

In [46]:
def ninth() -> pd.DataFrame:
    """
    Напишите запрос для подсчета количества студентов , сдававших экзамен
    по предмету обучения с идентификатором, равным 20.
    """
    query: Query = db.session.query(ExamMark).filter(ExamMark.subject_id == 20)
    return pd.DataFrame({"COUNT": [query.count(), ]})


ninth()

   COUNT
0      0

In [47]:
def tenth() -> pd.DataFrame:
    """
    Напишите запрос, который позволяет подсчитать в таблице EXAM_MARKS
    количество различных предметов обучения.
    """
    query: Query = db.session.query(ExamMark).group_by(ExamMark.subject_id)
    return pd.DataFrame({"COUNT": [query.count(), ]})


tenth()

   COUNT
0      2

In [48]:
def eleventh() -> pd.DataFrame:
    """
    Напишите запрос, который выполняет выборку для каждого студента
    значения его идентификатора и минимальной из полученных им оценок.
    """
    query: Query = db.session.query(
        ExamMark.student_id,
        func.min(ExamMark.mark).label("MIN_MARK")
    ).group_by(ExamMark.student_id)

    return create_dataframe(query.all())


eleventh()

   student_id  MIN_MARK
0           6         4
1          12         3
2          32         4
3          55         5

In [49]:
def twelve() -> pd.DataFrame:
    """
    Напишите запрос, который выполняет выборку для каждого студента
    значения его идентификатора и максимальной из полученных им оценок.
    """
    query: Query = db.session.query(
        ExamMark.student_id,
        func.max(ExamMark.mark).label("MAX_MARK")
    ).group_by(ExamMark.student_id)

    return create_dataframe(query.all())


twelve()

   student_id  MAX_MARK
0           6         4
1          12         5
2          32         4
3          55         5

In [50]:
def thirteenth() -> pd.DataFrame:
    """
    Напишите запрос, выполняющий вывод фамилии первого в алфавитном
    порядке (по фамилии) студента, фамилия которого начинается на букву “И”.
    """
    query: Query = (db.session.query(Student.last_name)
                    .filter(Student.last_name.ilike("И%"))
                    .order_by(Student.last_name))
    return pd.DataFrame({Student.last_name: [query.first().last_name, ]})


thirteenth()

  Student.last_name
0            Иванов

In [51]:
def fourteenth() -> pd.DataFrame:
    """
    Напишите запрос, который выполняет вывод для каждого предмета
    обучения на именование предмета и максимальное значение номера
    семестра, в котором этот предмет преподается.
    """
    query: Query = db.session.query(
        Subject.name,
        func.max(Subject.semester).label("MAX")
    ).group_by(Subject.id)
    return create_dataframe(query.all())


fourteenth()

          name  MAX
0  Информатика    1
1       Физика    1
2   Математика    2
3      История    4
4  Физкультура    5
5   Английский    3
6       Python    4

In [52]:
def fifteenth() -> pd.DataFrame:
    """
    Напишите запрос, который выполняет вывод данных для каждого
    конкретного дня сдачи экзамена о количестве студентов, сдававших
    экзамен в этот день.
    """
    query: Query = db.session.query(
        ExamMark.date,
        func.count(func.distinct(ExamMark.student_id)).label("COUNT_STUDENTS")
    ).group_by(ExamMark.date)
    return create_dataframe(query.all())


fifteenth()

        date  COUNT_STUDENTS
0 1999-06-17               1
1 1999-06-22               1
2 2000-01-05               1
3 2000-01-12               1
4 2000-01-18               1
5 2000-01-23               1

In [53]:
def sixteenth() -> pd.DataFrame:
    """
    Напишите запрос для получения среднего балла
    для каждого курса по каждому предмету.
    """
    query: Query = (db.session.query(Student.course,
                                     ExamMark.subject_id,
                                     func.avg(ExamMark.mark).label("AVG(MARK)"))
                    .join(Student)
                    .group_by(Student.course, ExamMark.subject_id)
                    .order_by(Student.course, ExamMark.subject_id))
    return create_dataframe(query.all())


sixteenth()

   course  subject_id  AVG(MARK)
0       2          10        5.0
1       2          22        3.0
2       4          22        4.0
3       5          10        4.5
4       5          22        NaN

In [54]:
def seventeenth() -> pd.DataFrame:
    """
    Напишите запрос для получения среднего балла для каждого студента.
    """
    query: Query = db.session.query(
        ExamMark.student_id,
        func.avg(ExamMark.mark).label("AVG(MARK)")
    ).group_by(ExamMark.student_id)
    return create_dataframe(query.all())


seventeenth()

   student_id  AVG(MARK)
0           6        4.0
1          12        4.0
2          32        4.0
3          55        5.0

In [55]:
def eighteenth() -> pd.DataFrame:
    """
    Напишите запрос для получения среднего балла для каждого экзамена.
    """
    query: Query = db.session.query(
        ExamMark.id,
        func.avg(ExamMark.mark).label("AVG(MARK)")
    ).group_by(ExamMark.id)
    return create_dataframe(query.all())


eighteenth()

    id  AVG(MARK)
0   34        4.0
1   43        4.0
2   75        5.0
3  145        5.0
4  238        3.0
5  639        NaN

In [56]:
def nineteenth() -> pd.DataFrame:
    """
    Напишите запрос для определения количества студентов, сдававших каждый экзамен
    """
    query: Query = db.session.query(
        ExamMark.id,
        func.count(ExamMark.student_id).label("COUNT(STUDENT_ID)")
    ).group_by(ExamMark.id)
    return create_dataframe(query.all())


nineteenth()

    id  COUNT(STUDENT_ID)
0   34                  1
1   43                  1
2   75                  1
3  145                  1
4  238                  1
5  639                  1

In [57]:
def twentieth() -> pd.DataFrame:
    """
    Напишите запрос для определения количества изучаемых предметов на каждом курсе
    """
    course = func.round((Subject.semester + 1) / 2).label("COURSE")
    query: Query = db.session.query(
        course,
        func.count(Subject.id).label("COUNT(SUBJECT_ID)")
    ).group_by(course)
    return create_dataframe(query.all())


twentieth()

   COURSE  COUNT(SUBJECT_ID)
0     1.0                  3
1     2.0                  3
2     3.0                  1